IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/TIMG12_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="TIMG12" HW_revision="1.0">
    <register id="TIMG12_FSUB_0" width="32" offset="0x400" description="Subsciber Port 0">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 15."/>
        </bitfield>
    </register>
    <register id="TIMG12_FSUB_1" width="32" offset="0x404" description="Subscriber Port 1">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 15."/>
        </bitfield>
    </register>
    <register id="TIMG12_FPUB_0" width="32" offset="0x444" description="Publisher Port 0">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 15."/>
        </bitfield>
    </register>
    <register id="TIMG12_FPUB_1" width="32" offset="0x448" description="Publisher Port 1">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 15."/>
        </bitfield>
    </register>
    <group id="TIMG12_GPRCM" name="TIMG12_GPRCM" instances="1" offset="0x800" instaddr="0x100" description="">
        <register id="TIMG12_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="TIMG12_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="TIMG12_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
    </group>
    <register id="TIMG12_CLKDIV" width="32" offset="0x1000" description="Clock Divider">
        <bitfield id="RATIO" description="Selects divide ratio of module clock" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="DIV_BY_1" value="0x0" description="Do not divide clock source"/>
            <bitenum id="DIV_BY_2" value="0x1" description="Divide clock source by 2"/>
            <bitenum id="DIV_BY_3" value="0x2" description="Divide clock source by 3"/>
            <bitenum id="DIV_BY_4" value="0x3" description="Divide clock source by 4"/>
            <bitenum id="DIV_BY_5" value="0x4" description="Divide clock source by 5"/>
            <bitenum id="DIV_BY_6" value="0x5" description="Divide clock source by 6"/>
            <bitenum id="DIV_BY_7" value="0x6" description="Divide clock source by 7"/>
            <bitenum id="DIV_BY_8" value="0x7" description="Divide clock source by 8"/>
        </bitfield>
    </register>
    <register id="TIMG12_CLKSEL" width="32" offset="0x1008" description="Clock Select for Ultra Low Power peripherals">
        <bitfield id="LFCLK_SEL" description="Selects LFCLK as clock source if enabled" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Does not select this clock as a source"/>
            <bitenum id="ENABLE" value="0x1" description="Select this clock as a source"/>
        </bitfield>
        <bitfield id="MFCLK_SEL" description="Selects MFCLK as clock source if enabled" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Does not select this clock as a source"/>
            <bitenum id="ENABLE" value="0x1" description="Select this clock as a source"/>
        </bitfield>
        <bitfield id="BUSCLK_SEL" description="Selects BUSCLK as clock source if enabled" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Does not select this clock as a source"/>
            <bitenum id="ENABLE" value="0x1" description="Select this clock as a source"/>
        </bitfield>
    </register>
    <register id="TIMG12_PDBGCTL" width="32" offset="0x1018" description="Peripheral Debug Control">
        <bitfield id="FREE" description="Free run control" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="STOP" value="0x0" description="The peripheral freezes functionality while the Core Halted input is asserted and resumes when it is deasserted."/>
            <bitenum id="RUN" value="0x1" description="The peripheral ignores the state of the Core Halted input"/>
        </bitfield>
        <bitfield id="SOFT" description="Soft halt boundary control. This function is only available, if [FREE] is set to 'STOP'" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="IMMEDIATE" value="0x0" description="The peripheral will halt immediately, even if the resultant state will result in corruption if the system is restarted"/>
            <bitenum id="DELAYED" value="0x1" description="The peripheral blocks the debug freeze until it has reached a boundary where it can resume without corruption"/>
        </bitfield>
    </register>
    <group id="TIMG12_INT_EVENT" name="TIMG12_INT_EVENT" instances="3" offset="0x1020" instaddr="0x30" description="">
        <register id="TIMG12_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="Z" value="0x1" description="Interrupt Source: Zero event"/>
                <bitenum id="L" value="0x2" description="REPLACE THIS WITH AN ACTUAL IRQ NAME"/>
                <bitenum id="CCD0" value="0x5" description="Interrupt Source: Capture or compare down event (CCD0)"/>
                <bitenum id="CCD1" value="0x6" description="Interrupt Source: Capture or compare down event (CCD1)"/>
                <bitenum id="CCD2" value="0x7" description="Interrupt Source: Capture or compare down event (CCD2)"/>
                <bitenum id="CCD3" value="0x8" description="Interrupt Source: Capture or compare down event (CCD3)"/>
                <bitenum id="CCU0" value="0x9" description="Interrupt Source: Capture or compare up event (CCU0)"/>
                <bitenum id="CCU1" value="0xA" description="Interrupt Source: Capture or compare up event (CCU1)"/>
                <bitenum id="CCU2" value="0xB" description="Interrupt Source: Capture or compare up event (CCU2)"/>
                <bitenum id="CCU3" value="0xC" description="Interrupt Source: Capture or compare up event (CCU3)"/>
                <bitenum id="CCD4" value="0xD" description="Interrupt Source: Compare down event (CCD4)"/>
                <bitenum id="CCD5" value="0xE" description="Interrupt Source: Compare down event (CCD5)"/>
                <bitenum id="CCU4" value="0xF" description="Interrupt Source: Compare down event (CCU4)"/>
                <bitenum id="CCU5" value="0x10" description="Interrupt Source: Compare down event (CCU5)"/>
                <bitenum id="F" value="0x19" description="Interrupt Source: Fault Event generated an interrupt."/>
                <bitenum id="TOV" value="0x1A" description="Interrupt Source: Trigger overflow"/>
                <bitenum id="REPC" value="0x1B" description="Repeat Counter Zero"/>
                <bitenum id="DC" value="0x1C" description="Interrupt Source: Direction Change"/>
                <bitenum id="QEIERR" value="0x1D" description="QEI Incorrect state transition error"/>
            </bitfield>
        </register>
