IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/TIMG12_1.0.xml
    </group>
    <group id="TIMG12_COUNTERREGS" name="TIMG12_COUNTERREGS" instances="1" offset="0x1800" instaddr="0x100" description="">
        <register id="TIMG12_CTR" width="32" offset="0x0" description="Counter Register">
            <bitfield id="CCTR" description="Current Counter value" begin="31" end="0" width="32" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFFFFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG12_CTRCTL" width="32" offset="0x4" description="Counter Control Register">
            <bitfield id="EN" description="Counter Enable.  This bit allows the timer to advance  This bit is automatically cleared if REPEAT=0 (do not automatically reload) and the counter value equals zero.  CPU Write: A register write that sets the EN bit, the counter value is set per the CVAE value. Hardware: This bit may also be set as the result of an LCOND or ZCOND condition being met and the counter value changed to the load value or zero value, respectively." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Disabled"/>
                <bitenum id="ENABLED" value="0x1" description="Enabled"/>
            </bitfield>
            <bitfield id="REPEAT" description="Repeat.  The repeat bit controls whether the counter continues to advance following a zero event, or the exiting of a debug or fault condition.  If counting down, a zero event is followed by a load at the next advance condition. If counting up-down, a zero event is followed by an advance event (+1). The intent of encoding 3 is that if the debug condition is in effect, the generation of the load pulse is deferred until the debug condition is over. This allows the counter to reach zero before counting is suspended." begin="3" end="1" width="3" rwaccess="R/W">
                <bitenum id="REPEAT_0" value="0x0" description="Does not automatically advance following a zero event."/>
                <bitenum id="REPEAT_1" value="0x1" description="Continues to advance following a zero event."/>
                <bitenum id="REPEAT_2" value="0x2" description="Reserved"/>
                <bitenum id="REPEAT_3" value="0x3" description="Continues to advance following a zero event if the debug mode is not in effect, or following the release of the debug mode."/>
                <bitenum id="REPEAT_4" value="0x4" description="Reserved"/>
            </bitfield>
            <bitfield id="CM" description="Count Mode" begin="5" end="4" width="2" rwaccess="R/W">
                <bitenum id="DOWN" value="0x0" description="Down"/>
                <bitenum id="UP_DOWN" value="0x1" description="Up/Down"/>
                <bitenum id="UP" value="0x2" description="Counter counts up."/>
            </bitfield>
            <bitfield id="CVAE" description="Counter Value After Enable.  This field specifies the initialization condition of the counter when the EN bit is changed from 0 to 1 by a write to the CTRCTL register. Note that an external event can also cause the EN bit to go active." begin="29" end="28" width="2" rwaccess="R/W">
                <bitenum id="LDVAL" value="0x0" description="The counter is set to the LOAD register value"/>
                <bitenum id="NOCHANGE" value="0x1" description="The counter value is unchanged from its current value which could have been initialized by software"/>
                <bitenum id="ZEROVAL" value="0x2" description="The counter is set to zero"/>
            </bitfield>
            <bitfield id="DRB" description="Debug Resume Behavior This bit specifies what the device does following the release/exit of debug mode." begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="RESUME" value="0x0" description="Resume counting"/>
                <bitenum id="CVAE_ACTION" value="0x1" description="Perform the action as specified by the CVAE field."/>
            </bitfield>
            <bitfield id="CLC" description="Counter Load Control.  This field specifies what controls the counter operation with respect to setting the counter to the LD register value. 

Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved." begin="9" end="7" width="3" rwaccess="R/W">
                <bitenum id="CCCTL0_LCOND" value="0x0" description="CCCTL_0 LCOND"/>
                <bitenum id="CCCTL1_LCOND" value="0x1" description="CCCTL_1 LCOND"/>
                <bitenum id="CCCTL2_LCOND" value="0x2" description="CCCTL_2 LCOND This value exists when there are 4 channels."/>
                <bitenum id="CCCTL3_LCOND" value="0x3" description="CCCTL_3 LCOND This value exists when there are 4 channels."/>
                <bitenum id="QEI_2INP" value="0x4" description="Controlled by 2 input QEI mode. This value exists when gptimer support QEI feature."/>
                <bitenum id="QEI_3INP" value="0x5" description="Controlled by 3 input QEI mode.  This value exists when gptimer support QEI feature."/>
            </bitfield>
            <bitfield id="CAC" description="Counter Advance Control.  This field specifies what controls the counter operation with respect to advancing (incrementing or decrementing) the counter value.  
Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved." begin="12" end="10" width="3" rwaccess="R/W">
                <bitenum id="CCCTL0_ACOND" value="0x0" description="CCCTL_0 ACOND"/>
                <bitenum id="CCCTL1_ACOND" value="0x1" description="CCCTL_1 ACOND"/>
                <bitenum id="CCCTL2_ACOND" value="0x2" description="CCCTL_2 ACOND This value exists when there are 4 channels."/>
                <bitenum id="CCCTL3_ACOND" value="0x3" description="CCCTL_3 ACOND This value exists when there are 4 channels."/>
                <bitenum id="QEI_2INP" value="0x4" description="Controlled by 2-input QEI mode  This value exists when gptimer support QEI feature."/>
                <bitenum id="QEI_3INP" value="0x5" description="Controlled by 3-input QEI mode  This value exists when gptimer support QEI feature."/>
            </bitfield>
            <bitfield id="CZC" description="Counter Zero Control This field specifies what controls the counter operation with respect to zeroing the counter value.  

Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved." begin="15" end="13" width="3" rwaccess="R/W">
                <bitenum id="CCCTL0_ZCOND" value="0x0" description="CCCTL_0 ZCOND"/>
                <bitenum id="CCCTL1_ZCOND" value="0x1" description="CCCTL_1 ZCOND"/>
                <bitenum id="CCCTL2_ZCOND" value="0x2" description="CCCTL_2 ZCOND This value exists when there are 4 channels."/>
                <bitenum id="CCCTL3_ZCOND" value="0x3" description="CCCTL_3 ZCOND This value exists when there are 4 channels."/>
                <bitenum id="QEI_2INP" value="0x4" description="Controlled by 2-input QEI mode  This value exists when gptimer support QEI feature."/>
                <bitenum id="QEI_3INP" value="0x5" description="Controlled by 3-input QEI mode  This value exists when gptimer support QEI feature."/>
            </bitfield>
        </register>
        <register id="TIMG12_LOAD" width="32" offset="0x8" description="Load Register">
            <bitfield id="LD" description="Load Value" begin="31" end="0" width="32" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFFFFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG12_CC_01" width="32" offset="0x10" instances="2" instaddr="0x4" description="Capture or Compare Register 0 to Capture or Compare Register 1">
            <bitfield id="CCVAL" description="Capture or compare value" begin="31" end="0" width="32" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG12_CCCTL_01" width="32" offset="0x30" instances="2" instaddr="0x4" description="Capture or Compare Control Registers">
            <bitfield id="CCOND" description="Capture Condition. #br# Specifies the condition that generates a capture pulse. 4h-Fh = Reserved" begin="2" end="0" width="3" rwaccess="R/W">
                <bitenum id="NOCAPTURE" value="0x0" description="None (never captures)"/>
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
            </bitfield>
            <bitfield id="ACOND" description="Advance Condition. #br# Specifies the condition that generates an advance pulse. 6h-Fh = Reserved" begin="6" end="4" width="3" rwaccess="R/W">
                <bitenum id="TIMCLK" value="0x0" description="Each TIMCLK"/>
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
                <bitenum id="CC_TRIG_HIGH" value="0x5" description="CCP High or Trigger assertion (level)"/>
            </bitfield>
            <bitfield id="LCOND" description="Load Condition. #br# Specifies the condition that generates a load pulse.  4h-Fh = Reserved" begin="10" end="8" width="3" rwaccess="R/W">
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
            </bitfield>
            <bitfield id="ZCOND" description="Zero Condition. #br# This field specifies the condition that generates a zero pulse. 4h-Fh = Reserved" begin="14" end="12" width="3" rwaccess="R/W">
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
            </bitfield>
            <bitfield id="COC" description="Capture or Compare. #br# Specifies whether the corresponding CC register is used as a capture register or a compare register (never both)." begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="COMPARE" value="0x0" description="Compare"/>
                <bitenum id="CAPTURE" value="0x1" description="Capture"/>
            </bitfield>
            <bitfield id="CCUPD" description="Capture and Compare Update Method
This field controls how updates to the pipelined
capture and compare register are performed
(when operating in compare mode, COC=0)." begin="20" end="18" width="3" rwaccess="R/W">
                <bitenum id="Immediately" value="0x0" description="Writes to the CCx_y register is written to the register directly and has immediate effect."/>
                <bitenum id="Zero_EVT" value="0x1" description="Following a zero event Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals 0."/>
                <bitenum id="Compare_Down_EVT" value="0x2" description="Following a compare (down) event Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals the CCx_y register value."/>
                <bitenum id="Compare_UP_EVT" value="0x3" description="Following a compare (up) event Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals the CCx_y register value."/>
                <bitenum id="ZERO_LOAD_EVT" value="0x4" description="Following a zero or load event Writes to the CCx_y register are stored in shadow register and transferred to ECCx_y in the TIMCLK cycle following CTR equals 0 or CTR. Equals LD.  Note this update mechanism is defined for use only in configurations using up/down counting. This mode is not intended for use in down count configurations."/>
                <bitenum id="ZERO_RC_ZERO_EVT" value="0x5" description="Following a zero event with repeat count also zero.  Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals 0 and if RC equal 0."/>
                <bitenum id="TRIG" value="0x6" description="Following a TRIG pulse.  Writes to the CCx_y register are stored in shadow register and transferred to CCx_y #xD;
0."/>
            </bitfield>
            <bitfield id="CCACTUPD" description="CCACT shadow register Update Method
This field controls how updates to the CCCACT shadow register are performed" begin="28" end="26" width="3" rwaccess="R/W">
                <bitenum id="Immediately" value="0x0" description="Value written to the CCACT register has immediate effect."/>
                <bitenum id="Zero_EVT" value="0x1" description="Following a zero event Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0."/>
                <bitenum id="Compare_Down_EVT" value="0x2" description="Following a compare (down) event Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals the CCx_y register value."/>
                <bitenum id="Compare_UP_EVT" value="0x3" description="Following a compare (up) event Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals the CCx_y register value."/>
                <bitenum id="ZERO_LOAD_EVT" value="0x4" description="Following a zero or load event Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0 or CTR. Equals LDn.  Note this update mechanism is defined for use only in configurations using up/down counting. This mode is not intended for use in down count configurations."/>
                <bitenum id="ZERO_RC_ZERO_EVT" value="0x5" description="Following a zero event with repeat count also zero.  Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0 and if RC equal 0."/>
                <bitenum id="TRIG" value="0x6" description="On a TRIG pulse, the value stored in CCACTx_y shadow register is loaded into CCACTx_y active register."/>
            </bitfield>
            <bitfield id="CC2SELU" description="Selects the source second CCU event." begin="24" end="22" width="3" rwaccess="R/W">
                <bitenum id="SEL_CCU0" value="0x0" description="Selects CCU from CC0."/>
                <bitenum id="SEL_CCU1" value="0x1" description="Selects CCU from CC1."/>
                <bitenum id="SEL_CCU2" value="0x2" description="Selects CCU from CC2."/>
                <bitenum id="SEL_CCU3" value="0x3" description="Selects CCU from CC3."/>
                <bitenum id="SEL_CCU4" value="0x4" description="Selects CCU from CC4."/>
                <bitenum id="SEL_CCU5" value="0x5" description="Selects CCU from CC5."/>
            </bitfield>
            <bitfield id="CC2SELD" description="Selects the source second CCD event." begin="31" end="29" width="3" rwaccess="R/W">
                <bitenum id="SEL_CCD0" value="0x0" description="Selects CCD from CC0."/>
                <bitenum id="SEL_CCD1" value="0x1" description="Selects CCD from CC1."/>
                <bitenum id="SEL_CCD2" value="0x2" description="Selects CCD from CC2."/>
                <bitenum id="SEL_CCD3" value="0x3" description="Selects CCD from CC3."/>
                <bitenum id="SEL_CCD4" value="0x4" description="Selects CCD from CC4."/>
                <bitenum id="SEL_CCD5" value="0x5" description="Selects CCD from CC5."/>
            </bitfield>
        </register>
        <register id="TIMG12_OCTL_01" width="32" offset="0x50" instances="2" instaddr="0x4" description="CCP Output Control Registers">
            <bitfield id="CCPOINV" description="CCP Output Invert The output as selected by CCPO is conditionally inverted." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NOINV" value="0x0" description="No inversion"/>
                <bitenum id="INV" value="0x1" description="Invert"/>
            </bitfield>
            <bitfield id="CCPIV" description="CCP Initial Value This bit specifies the logical value put on the signal generator state while the counter is disabled (CTRCTL.EN == 0)." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="LOW" value="0x0" description="Low"/>
                <bitenum id="HIGH" value="0x1" description="High"/>
            </bitfield>
            <bitfield id="CCPO" description="CCP Output Source" begin="3" end="0" width="4" rwaccess="R/W">
                <bitenum id="FUNCVAL" value="0x0" description="Signal generator value (for example, PWM, triggered PWM)"/>
                <bitenum id="LOAD" value="0x1" description="Load condition"/>
                <bitenum id="CMPVAL" value="0x2" description="Compare value = counter condition"/>
                <bitenum id="ZERO" value="0x4" description="Zero condition"/>
                <bitenum id="CAPCOND" value="0x5" description="Capture condition"/>
                <bitenum id="FAULTCOND" value="0x6" description="Fault Condition"/>
                <bitenum id="CC0_MIRROR_ALL" value="0x8" description="Mirror CCP of first capture and compare register in counter group"/>
                <bitenum id="CC1_MIRROR_ALL" value="0x9" description="Mirror CCP of second capture and compare register in counter group"/>
                <bitenum id="DEADBAND" value="0xC" description="Deadband Inserted Output"/>
                <bitenum id="CNTDIR" value="0xD" description="Counter direction"/>
            </bitfield>
        </register>
        <register id="TIMG12_CCACT_01" width="32" offset="0x70" instances="2" instaddr="0x4" description="Capture or Compare Action Registers">
            <bitfield id="ZACT" description="CCP Output Action on Zero  Specifies what changes occur to CCP output as the result of a zero event." begin="1" end="0" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="LACT" description="CCP Output Action on Load  Specifies what changes occur to CCP output as the result of a load event." begin="4" end="3" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="CDACT" description="CCP Output Action on Compare (Down)  This field describes the resulting action of the signal generator upon detecting a compare event while counting down." begin="7" end="6" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="CUACT" description="CCP Output Action on Compare (Up)  This field describes the resulting action of the signal generator upon detecting a compare event while counting up." begin="10" end="9" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="CC2DACT" description="CCP Output Action on CC2D event." begin="13" end="12" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="CC2UACT" description="CCP Output Action on CC2U event." begin="16" end="15" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="SWFRCACT" description="CCP Output Action on Software Force Output

This field describes the resulting action of software force.

